Backend/app/controllers/radar_templates_controller.rb

INSERT INTO "axes" ("name", "created_at", "updated_at", "description", "radar_template_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "radar_templates" ("description", "name", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Radar 2015"], ["name", "New Radar Template"], ["created_at", "2020-09-29 17:09:51.305421"], ["updated_at", "2020-09-29 17:09:51.305421"], ["owner_id", 37]]
INSERT INTO "users" ("uid", "name", "email", "created_at", "updated_at", "provider") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["uid", "54321"], ["name", "pino"], ["email", "pino@pino.com"], ["created_at", "2020-09-16 15:11:20.007972"], ["updated_at", "2020-09-16 15:11:20.007972"], ["provider", "google_oauth2"]]
---
  def create
    axes = params.require(:axes).map { |axis| create_axis(axis) }
    name = params.require(:name)
    description = params.require(:description)
    radar_template = RadarTemplate.create!(axes: axes, name: name, description: description, user_id: @logged_user['id'])

SELECT  "radar_templates".* FROM "radar_templates" WHERE "radar_templates"."id" = $1 ORDER BY "radar_templates"."created_at" DESC LIMIT $2  [["id", -1], ["LIMIT", 1]]
---
  def show
    radar_template = RadarTemplate.find(params.require(:id))