Backend/app/controllers/votes_controller.rb

  def create
    radar = Radar.find(params.require(:radar_id))
    answers = create_answers(radar, params.require(:answers))
    vote = Vote.create!(answers: answers)
---
SELECT  "radars".* FROM "radars" WHERE "radars"."id" = $1 ORDER BY "radars"."created_at" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]
INSERT INTO "answers" ("points", "vote_id", "created_at", "updated_at", "axis_id", "radar_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["points", 3], ["vote_id", 3], ["created_at", "2020-09-29 17:17:41.999356"], ["updated_at", "2020-09-29 17:17:41.999356"], ["axis_id", 117], ["radar_id", 11]]
INSERT INTO "votes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-09-29 17:17:41.996818"], ["updated_at", "2020-09-29 17:17:41.996818"]]