app/controllers/radars_controller.rb

  def create
    axes = params.require(:axes).map { |axis| create_axis(axis) }
    name = params.require(:name)
    description = params.require(:description)

    radar = Radar.create!(axes: axes, name: name, description: description)
---
INSERT INTO "radars" ("created_at", "updated_at", "description", "name", "radar_template_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2020-09-16 16:55:21.848718"], ["updated_at", "2020-09-16 16:55:21.848718"], ["description", "Radar 2015"], ["name", "New Radar"], ["radar_template_id", 135]]

  def result
    radar = Radar.find(params.require(:id))
---
SELECT  "radars".* FROM "radars" WHERE "radars"."id" = $1 ORDER BY "radars"."created_at" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def show
    radar = Radar.find(params.require(:id))
---
SELECT  "radars".* FROM "radars" WHERE "radars"."id" = $1 ORDER BY "radars"."created_at" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def close
    radar = Radar.find(params.require(:id))
    radar.close
    radar.save
---
SELECT  "radars".* FROM "radars" WHERE "radars"."id" = $1 ORDER BY "radars"."created_at" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "radars" SET "active" = $1, "updated_at" = $2 WHERE "radars"."id" = $3  [["active", "f"], ["updated_at", "2020-09-16 16:55:22.096168"], ["id", 9]]